package fishAnimation

import (
	"fmt"
	"time"
)

func AnimateFish() {
	frames := []string{
		`|                     |`,
		`| >                   |`,
		`| (º>                 |`,
		`| (((º>               |`,
		`| ><(((º>             |`,
		`|   ><(((º>           |`,
		`|     ><(((º>         |`,
		`|       ><(((º>       |`,
		`|         ><(((º>     |`,
		`|           ><(((º>   |`,
		`|             ><(((º> |`,
		`|               ><((( |`,
		`|                 ><( |`,
		`|                   > |`,
		`|                     |`,
		`| >                   |`,
		`| (º>                 |`,
		`| (((º>               |`,
		`| ><(((º>             |`,
		`|   ><(((º>           |`,
		`|     ><(((º>         |`,
		`|       ><(((º>       |`,
		`|         ><(((º>     |`,
		`|           ><(((º>   |`,
		`|             ><(((º> |`,
		`|               ><((( |`,
		`|                 ><( |`,
		`|                   > |`,
		`|                     |`,
	}

	for i := 0; i < len(frames); i++ {
		fmt.Printf("\r%s", frames[i])
		time.Sleep(300 * time.Millisecond)
	}
	fmt.Println()
}
